<a href="https://colab.research.google.com/github/temple17/python-for-data-analysis-2nd-edition/blob/main/Chapter6(p_185~).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [3]:
filename = '/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex1.csv'

In [4]:
df = pd.read_csv(filename)

In [5]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
pd.read_table('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex1.csv', sep = ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex2.csv', header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [8]:
pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex1.csv', names = ['a','b','c','d','message'])

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [9]:
names = ['a','b','c','d','message']

In [10]:
pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex2.csv', names = names, index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
parsed = pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/csv_mindex.csv', index_col = ['key1','key2'])

In [12]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [13]:
list(open('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [14]:
result = pd.read_table('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex3.txt', sep = '\s+')

In [15]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [16]:
pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
result = pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex5.csv')

In [18]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [20]:
result = pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex5.csv', na_values=['NULL'])

In [21]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [22]:
sentinels = {'message': ['foo','NA'], 'something': ['two']}

In [23]:
pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [25]:
# Reading text files in pieces

pd.options.display.max_rows = 10

In [26]:
result = pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex6.csv')

In [27]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [28]:
pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex6.csv', nrows = 5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [29]:
chunker = pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex6.csv', chunksize = 1000)

In [30]:
chunker

In [38]:
chunker = pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex6.csv', chunksize = 1000)

tot = pd.Series([], dtype='float64')
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value = 0)
tot = tot.sort_values(ascending = False)

In [39]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [40]:
# Writing data to text format

data = pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex5.csv')

In [41]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [42]:
data.to_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/out.csv')

In [45]:
with open('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/out.csv') as f:
    for line in f:
        print(line)

,something,a,b,c,d,message

0,one,1,2,3.0,4,

1,two,5,6,,8,world

2,three,9,10,11.0,12,foo

In [46]:
import sys

In [47]:
data.to_csv(sys.stdout, sep = '|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [48]:
data.to_csv(sys.stdout, na_rep = 'NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [49]:
data.to_csv(sys.stdout, index = False, header = False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [50]:
data.to_csv(sys.stdout, index = False, columns = ['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [51]:
dates = pd.date_range('1/1/2000', periods=7)

In [52]:
ts = pd.Series(np.arange(7), index = dates)

In [53]:
ts.to_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/tseries.csv')

In [54]:
with open('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/tseries.csv') as f:
    for line in f:
        print(line)

,0

2000-01-01,0

2000-01-02,1

2000-01-03,2

2000-01-04,3

2000-01-05,4

2000-01-06,5

2000-01-07,6

In [55]:
# Working with Delimited Formats

with open('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex7.csv') as f:
    for line in f:
        print(line)

"a","b","c"

"1","2","3"

"1","2","3"

In [56]:
import csv

f = open('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex7.csv')

reader = csv.reader(f)

In [58]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [59]:
with open('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [61]:
header, values = lines[0], lines[1:]

In [62]:
data_dict = {h: v for h,v in zip(header, zip(*values))}

In [63]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [82]:
import csv 
f = open("/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex7.csv")
reader = csv.reader(f)

class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter= ';'
    quotechar= '"'
    quoting = csv.QUOTE_MINIMAL

reader = csv.reader(f, dialect=my_dialect)

In [83]:
for line in reader:
    print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

In [ ]:
# JSON DATA